rayshobby/opensprinkler/OpenSprinkler Controller/software/arduino-code/hardware/aopensprinkler/boards.txt
############################################################

atmega644.name=OpenSprinklerGen2

atmega644.upload.using=arduino:usbtinyisp
atmega644.upload.maximum_size=65536
atmega644.upload.speed=57600

atmega644.bootloader.low_fuses=0xE2
atmega644.bootloader.high_fuses=0xD1
atmega644.bootloader.extended_fuses=0xFE
atmega644.bootloader.path=atmega
atmega644.bootloader.file=ATmegaBOOT_168_atmega644.hex
#atmega644.bootloader.file=ATmegaBOOT_644.hex
atmega644.bootloader.unlock_bits=0x3F
atmega644.bootloader.lock_bits=0x0F

atmega644.build.mcu=atmega644
atmega644.build.f_cpu=8000000L
atmega644.build.core=arduino
atmega644.build.variant=standard

##############################################################


